Type generated gridlines will become non-associated due to changes in the type. Press delete if you wish to remove them instead.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DependentGridlineMayBeDeleted { get; }
  Visual Basic
Public Shared ReadOnly Property DependentGridlineMayBeDeleted As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DependentGridlineMayBeDeleted {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace